MODELS = {
    "GPT-4o": "gpt-4o",
    "Gemini 1.5 Pro": "gemini-1.5-pro",
    "Gemini 2.0 Flash": "gemini-2.0-flash",
    "Claude 3.5 Sonnet": "claude-3-5-sonnet-20241022",
    "Claude 3.7 Sonnet": "claude-3-7-sonnet-latest",
}

MODEL_NAME_TO_CHOICE = {
    "gpt-4o": "GPT-4o",
    "gemini-1.5-pro": "Gemini 1.5 Pro",
    "gemini-2.0-flash": "Gemini 2.0 Flash",
    "claude-3-5-sonnet-20241022": "Claude 3.5 Sonnet",
    "claude-3-7-sonnet-latest": "Claude 3.7 Sonnet",
}

MODELS_PATH = {
    "GPT-4o": "gpt_4o",
    "Gemini 1.5 Pro": "gemini_1_5_pro",
    "Gemini 2.0 Flash": "gemini_2_0_flash",
    "Claude 3.5 Sonnet": "claude_3_5_sonnet",
    "Claude 3.7 Sonnet": "claude_3_7_sonnet",
}

BOOKS = {
    # "Іван Нечуйлевицький - Кайдашева Сім'я": "nechuy-levytskyy-ivan-semenovych-kaydasheva-simia.json",
    # "Іван Франко - Захар Беркут": "zahar-berkut.json",
    "Тарас Шевченко - Катерина": "katerina.json",
    "Тарас Шевченко - Сон (комедія)": "son.json",
    "Іван Нечуйлевицький - Кайдашева сім'я": "kaydasheva-simia.json",
}

BOOKS_FOR_CLASSES = {
    "7-A": {
        "Іван Франко - Захар Беркут": "zahar-berkut.json",
    },
    "7-B": {
        "Іван Франко - Захар Беркут": "zahar-berkut.json",
    },
    "7-C": {
        "Іван Франко - Захар Беркут": "zahar-berkut.json",
    },
    "7-D": {
        "Іван Франко - Захар Беркут": "zahar-berkut.json",
    },
    "9": {
        "Тарас Шевченко - Катерина": "katerina.json",
        # "Тарас Шевченко - Сон (комедія)": "son.json",
    },
    "10": {
        "Іван Нечуйлевицький - Кайдашева сім'я": "kaydasheva-simia.json",
    },
}

CLASSES = [
    # "7-A", "7-B", "7-C", "7-D",
    "9", "10"
]

STUDENTS = {
    "7-A": [
        "Вчитель",
        "Гайворонський Владислав",
        "Гордін Георгій",
        "Гуменний Станіслав",
        "Денчик Данило",
        "Кичила Ілля",
        "Климчкук Марія",
        "Коньков Владислав",
        "Молчанов Лев",
        "Нємець Майя",
        "Панасенко Микита",
        "Паславська Марія",
        "Рипаленко Артем",
        "Савченко Роман",
        "Смолкіна Соф'я",
        "Страховецька Софія",
    ],
    "7-B": [
        "Вчитель",
        "Авдєєва Аліса",
        "Агапов Олександр",
        "Горюн Любава",
        "Доротюк Варвара",
        "Дробот Дмитро",
        "Зіоменко Олег",
        "Золотько Варвара",
        "Ільєнко Софія",
        "Книш Ксенія",
        "Кувалдіна Катерина",
        "Лемішев Кирило",
        "Хоменко Валерія",
        "Хорошавіна Софія",
        "Шепеленко Віола",
        "Щербина Герасим",
    ],
    "7-C": [
        "Вчитель",
        "Безрук Дар'я",
        "Бець Вероніка",
        "Головньова Владислава",
        "Данченков Микита",
        "Кадничанський Іосиф",
        "Конопельцева Мілана",
        "Муковоз Гліб",
        "Положій Захар",
        "Поручіков Владислав",
        "Прокіпець Вероніка",
        "Сирота Дмитро",
        "Сомов Максим",
        "Таран Вікторія",
        "Чумачок Софія",
        "Шигалевська Марія",
    ],
    "7-D": [
        "Вчитель",
        "Капустеринська Аліса",
        "Леонідова Мілада",
        "Олійник Давід",
        "Чуйко Данило",
        "Шевченко Олександра",
        "Щербакова Марія",
    ],
    "9": [
        "Вчитель",
        "Гуменний Владислав",
        "Зоц Володимир",
        "Коваленко Леонід",
        "Колмогорова Віолетта",
        "Коротких Віталій",
        "Кудрявець Ганна",
        "Куцак Олександр",
        "Овчинніков Сергій",
        "Рудік Аліса",
        "Саутенко Леон",
        "Смоляна Ярослава",
        "Соколенко Єва",
        "Страховецька Єлізавета",
        "Філіпенко Іларіон",
        "Цимбалов Сергій",
        "Шеін Олексій",
    ],
    "10": [
        "Вчитель",
        "Агапова Дарія",
        "Бикова Марія",
        "Божко Кирило",
        "Виговська Поліна",
        "Золотарьова Анна",
        "Клейтман Герман",
        "Клименко Михайло",
        "Крокас Марія",
        "Курбонов Абдуллаґ",
        "Курбонова Фотимахон",
        "Левагін Єлисей",
        "Любічева Діана",
        "Обидьонкіна Веселина",
        "Палій Поліна",
        "Радіонов Дан",
        "Сербін Віталій",
        "Сметанік Єва",
        "Стариковська Софія",
    ]
}
